In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import DataFrame, Series

In [10]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
      'data1': np.arange(7)})

In [12]:
df2 = DataFrame({'key': ['a', 'b', 'd'], 'data2': np.arange(3)})

In [9]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [13]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [14]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [15]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [16]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
      'data1': np.arange(7)})

In [17]:
df4 = DataFrame({'rkey': ['a', 'b', 'd'], 'data2': np.arange(3)})

In [18]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [19]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                  'value': np.arange(6)})

In [21]:
right = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [22]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [23]:
right

   group_val
a        3.5
b        7.0

In [24]:
pd.merge(left1, right, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0